---
kind: method
id: M:Autodesk.Revit.UI.RibbonPanel.GetItems
zh: 功能区
source: html/be85a04a-b901-3e28-6dfc-aa452be63dd2.htm
---
# Autodesk.Revit.UI.RibbonPanel.GetItems Method

**中文**: 功能区

Gets a copy of the collection of RibbonItems assigned to the RibbonPanel.

## Syntax (C#)
```csharp
public IList<RibbonItem> GetItems()
```

## Remarks
This method gets the items assigned to the RibbonPanel.